src/plunet/mocks/data-order/search/2024-05-04.json

[
	{
		"IntegerArrayResult": {
			"statusCode": "0",
			"statusCodeAlphanumeric": "GEN_1",
			"statusMessage": "OK",
			"data": [
				"2247213",
				"2247214",
				"2247215",
				"2247216",
				"2247217",
				"2247218",
				"2247219",
				"2247220",
				"2247221",
				"2247222",
				"2247223",
				"2247224",
				"2247225",
				"2247226",
				"2247227",
				"2247228",
				"2247229",
				"2247230",
				"2247231",
				"2247232",
				"2247233",
				"2247234",
				"2247235",
				"2247236",
				"2247237",
				"2247238",
				"2247239",
				"2247240",
				"2247241",
				"2247242",
				"2247243",
				"2247244",
				"2247245",
				"2247246",
				"2247247",
				"2247248",
				"2247249",
				"2247250",
				"2247251",
				"2247252",
				"2247253",
				"2247254",
				"2247255",
				"2247256",
				"2247257",
				"2247258",
				"2247259",
				"2247260",
				"2247261",
				"2247262",
				"2247263",
				"2247264",
				"2247265",
				"2247266",
				"2247268",
				"2247269",
				"2247270",
				"2247271",
				"2247272",
				"2247273",
				"2247274",
				"2247275",
				"2247276",
				"2247277",
				"2247278",
				"2247279",
				"2247280",
				"2247281",
				"2247282",
				"2247283",
				"2247284",
				"2247285",
				"2247286",
				"2247287",
				"2247288",
				"2247289",
				"2247290",
				"2247291",
				"2247292",
				"2247293",
				"2247294",
				"2247295",
				"2247296",
				"2247311"
			]
		}
	},
	"<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://www.w3.org/2003/05/soap-envelope\"><S:Body><ns2:searchResponse xmlns:ns2=\"http://API.Integration/\"><IntegerArrayResult><statusCode>0</statusCode><statusCodeAlphanumeric>GEN_1</statusCodeAlphanumeric><statusMessage>OK</statusMessage><data>2247213</data><data>2247214</data><data>2247215</data><data>2247216</data><data>2247217</data><data>2247218</data><data>2247219</data><data>2247220</data><data>2247221</data><data>2247222</data><data>2247223</data><data>2247224</data><data>2247225</data><data>2247226</data><data>2247227</data><data>2247228</data><data>2247229</data><data>2247230</data><data>2247231</data><data>2247232</data><data>2247233</data><data>2247234</data><data>2247235</data><data>2247236</data><data>2247237</data><data>2247238</data><data>2247239</data><data>2247240</data><data>2247241</data><data>2247242</data><data>2247243</data><data>2247244</data><data>2247245</data><data>2247246</data><data>2247247</data><data>2247248</data><data>2247249</data><data>2247250</data><data>2247251</data><data>2247252</data><data>2247253</data><data>2247254</data><data>2247255</data><data>2247256</data><data>2247257</data><data>2247258</data><data>2247259</data><data>2247260</data><data>2247261</data><data>2247262</data><data>2247263</data><data>2247264</data><data>2247265</data><data>2247266</data><data>2247268</data><data>2247269</data><data>2247270</data><data>2247271</data><data>2247272</data><data>2247273</data><data>2247274</data><data>2247275</data><data>2247276</data><data>2247277</data><data>2247278</data><data>2247279</data><data>2247280</data><data>2247281</data><data>2247282</data><data>2247283</data><data>2247284</data><data>2247285</data><data>2247286</data><data>2247287</data><data>2247288</data><data>2247289</data><data>2247290</data><data>2247291</data><data>2247292</data><data>2247293</data><data>2247294</data><data>2247295</data><data>2247296</data><data>2247311</data></IntegerArrayResult></ns2:searchResponse></S:Body></S:Envelope>",
	null,
	"<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"  xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\" xmlns:tns=\"http://API.Integration/\"><soap:Body><tns:search><UUID>883fcc90-5fe0-48ee-84e5-92e88a5558bf</UUID><SearchFilter><customerId>-1</customerId><languageCode>EN</languageCode><orderStatus>-1</orderStatus><projectType>-1</projectType><statusProjectFileArchiving>-1</statusProjectFileArchiving><timeFrame><dateFrom>2023-05-22</dateFrom><dateTo>2023-05-22</dateTo><dateRelation>1</dateRelation></timeFrame></SearchFilter></tns:search></soap:Body></soap:Envelope>",
	null
]